*******************************************
CHAPTER 7 Event manager  
*******************************************

Система управления событиями
==============================
Данная система предназначена для работы с событиями и релизует весь соответствуюзий функционал.
Реализована в виде синглтона, вызывается из системы управления сообщениями при соответствующих запросах пользователя.Использует систему управления сессиями.

Реализация системы управления событиями
=========================================
.. automodule:: mainServer.eventManager
    :members:

