*******************************************
CHAPTER 5 Session manager  
*******************************************

Система управления сессиями
=============================
Одна из основных подсистем: очень часто вызывается другими системами. Управляет сессиями пользователями а так же реализует фоновую подчистку старых сессий: с некоторым таймаутом пользователи отсоединяется от сервера, если они не проявляли активность.

Реализация система управления сессиями
========================================
.. automodule:: mainServer.sessionManager
    :members:

